index.org

#+TITLE: Home

* Who am I?
Hi! I'm Skyler, a teenaged developer. I work with [[https://clicksminuteper.net][Clicks Minute Per]] to make discord bots & websites for fun, for money and because they're cool. We do development, designing & hosting in-house.

* What is the EPQ?
EPQ stands for /Extended Project Qualification/; it's an independent project worth half an a-level. It helps build skills such as time-management and research.

I'm taking the EPQ because my 6th form requires me to take it, however it also offers benefits in other areas and it can't be said that me taking the EPQ was entirely down to my 6th-form, I did choose to go here after all. The EPQ (as previously mentioned) helps develop various skills, people who've taken an EPQ tend to have higher grades overall and the EPQ also looks great on a personal statement or university application, with some universities even offering lower grade requirements if you get high EPQ grades. All-in-all it's a great opportunity for me.

* What am I doing for EPQ?
For my EPQ, I'm making a process management daemon. I [[file:Documents/process-manager-project-requirements.org][wrote a specification in year 11 for what this could look like]], which is what I'll be following as a rough guide. When the project is finished, I'll be taking it on to our production server and using it to run all of our bots, websites & other projects.

* All pages
- [[file:credits.org][Credits, Licenses & Sources]] (Created on 2021-10-27 at 18:19:44)
- *Notes/*
  - [[file:Notes/20211029093544-what_exactly_is_containerd.org][What exactly is containerd]] (Created on 2021-10-29 at 08:35:47)
  - [[file:Notes/20211025183307-docker_vs_lxc.org][Docker vs LXC]] (Created on 2021-10-28 at 21:07:10)
  - [[file:Notes/20211028133315-former_project_example_analysis.org][Former project example analysis]] (Created on 2021-10-28 at 20:02:49)
  - [[file:Notes/20211028204303-why_switch_from_notion.org][Why switch from notion? (Soon™)]] (Created on 2021-10-28 at 19:43:31)
  - [[file:Notes/20211027145658-templates.org][Templates]] (Created on 2021-10-27 at 13:56:59)
  - [[file:Notes/20211025184129-our_current_infrastructure.org][Our current infrastructure]] (Created on 2021-10-26 at 18:18:35)
  - [[file:Notes/20211025183249-an_investigation_into_containerization.org][An investigation into containerization]] (Created on 2021-10-26 at 08:25:09)
  - [[file:Notes/20211018105127-homepage.org][Notes]] (Created on 2021-10-26 at 07:15:35)
  - [[file:Notes/20211024201928-upper_6th_meeting.org][Upper 6th Meeting]] (Created on 2021-10-24 at 19:33:54)
  - [[file:Notes/20211024202440-can_my_project_be_researched.org][Can my project be researched?]] (Created on 2021-10-24 at 19:31:01)
  - *Notes/daily/*
    - [[file:Notes/daily/2021-10-29.org][2021-10-29]] (Created on 2021-10-29 at 08:34:43)
    - [[file:Notes/daily/2021-10-28.org][2021-10-28]] (Created on 2021-10-29 at 08:03:50)
    - [[file:Notes/daily/2021-10-27.org][2021-10-27]] (Created on 2021-10-28 at 09:21:06)
    - [[file:Notes/daily/2021-10-26.org][2021-10-26]] (Created on 2021-10-27 at 13:53:03)
    - [[file:Notes/daily/2021-10-25.org][2021-10-25]] (Created on 2021-10-25 at 09:11:48)
    - [[file:Notes/daily/2021-10-24.org][2021-10-24]] (Created on 2021-10-25 at 07:26:46)
    - [[file:Notes/daily/2021-10-23.org][2021-10-23]] (Created on 2021-10-23 at 22:07:27)
- *Documents/*
  - [[file:Documents/project-progression-record.org][(Soon™) Project Progression Record (PPR)]] (Created on 2021-10-25 at 09:09:39)
  - [[file:Documents/personal-audit.org][EPQ personal audit]] (Created on 2021-10-25 at 08:49:14)
  - [[file:Documents/poem-based-on-an-image.org][Just existing]] (Created on 2021-10-25 at 08:19:21)
  - [[file:Documents/questioning-a-co-owner.org][Doing research on what users would like to see]] (Created on 2021-10-24 at 19:50:17)
  - [[file:Documents/project-idea-mindmap.org][Mindmap of project ideas]] (Created on 2021-10-24 at 19:38:54)
  - [[file:Documents/process-manager-project-requirements.org][Project specification]] (Created on 2021-10-24 at 17:23:18)
  - [[file:Documents/why-this-project.org][Why have I chosen this project?]] (Created on 2021-10-19 at 21:33:19)