index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Home</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="/simple.min.css" /><link rel="stylesheet" href="/custom.css" />
</head>
<body>
<div id="preamble" class="status">

<div class="header">
    <span class="title">Home</span>
    <div class="links">
        <a href="/">Home</a>
        <a href="/Notes/daily/2021-10-29.html">Latest daily</a>
        <a href="https://github.com/Minion3665/EPQ/issues/new">Report issue</a>
        <a href="https://github.com/Minion3665/EPQ">View source</a>
    </div>
</div>
</div>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org5f3a307">Who am I?</a></li>
<li><a href="#org7345311">What is the EPQ?</a></li>
<li><a href="#org1188baa">What am I doing for EPQ?</a></li>
<li><a href="#orgac6bbda">All pages</a></li>
</ul>
</div>
</div>

<div id="outline-container-org5f3a307" class="outline-2">
<h2 id="org5f3a307">Who am I?</h2>
<div class="outline-text-2" id="text-org5f3a307">
<p>
Hi! I'm Skyler, a teenaged developer. I work with <a href="https://clicksminuteper.net">Clicks Minute Per</a> to make discord bots &amp; websites for fun, for money and because they're cool. We do development, designing &amp; hosting in-house.
</p>
</div>
</div>

<div id="outline-container-org7345311" class="outline-2">
<h2 id="org7345311">What is the EPQ?</h2>
<div class="outline-text-2" id="text-org7345311">
<p>
EPQ stands for <i>Extended Project Qualification</i>; it's an independent project worth half an a-level. It helps build skills such as time-management and research.
</p>

<p>
I'm taking the EPQ because my 6th form requires me to take it, however it also offers benefits in other areas and it can't be said that me taking the EPQ was entirely down to my 6th-form, I did choose to go here after all. The EPQ (as previously mentioned) helps develop various skills, people who've taken an EPQ tend to have higher grades overall and the EPQ also looks great on a personal statement or university application, with some universities even offering lower grade requirements if you get high EPQ grades. All-in-all it's a great opportunity for me.
</p>
</div>
</div>

<div id="outline-container-org1188baa" class="outline-2">
<h2 id="org1188baa">What am I doing for EPQ?</h2>
<div class="outline-text-2" id="text-org1188baa">
<p>
For my EPQ, I'm making a process management daemon. I <a href="Documents/process-manager-project-requirements.html">wrote a specification in year 11 for what this could look like</a>, which is what I'll be following as a rough guide. When the project is finished, I'll be taking it on to our production server and using it to run all of our bots, websites &amp; other projects.
</p>
</div>
</div>

<div id="outline-container-orgac6bbda" class="outline-2">
<h2 id="orgac6bbda">All pages</h2>
<div class="outline-text-2" id="text-orgac6bbda">
<ul class="org-ul">
<li><a href="credits.html">Credits, Licenses &amp; Sources</a> (Created on 2021-10-27 at 18:19:44)</li>
<li><b>Notes/</b>
<ul class="org-ul">
<li><a href="Notes/20211028133315-former_project_example_analysis.html">Former project example analysis</a> (Created on 2021-10-31 at 10:24:18)</li>
<li><a href="Notes/20211029093544-what_exactly_is_containerd.html">What exactly is containerd</a> (Created on 2021-10-29 at 08:35:47)</li>
<li><a href="Notes/20211025183307-docker_vs_lxc.html">Docker vs LXC</a> (Created on 2021-10-28 at 21:07:10)</li>
<li><a href="Notes/20211028204303-why_switch_from_notion.html">Why switch from notion? (Soon™)</a> (Created on 2021-10-28 at 19:43:31)</li>
<li><a href="Notes/20211027145658-templates.html">Templates</a> (Created on 2021-10-27 at 13:56:59)</li>
<li><a href="Notes/20211025184129-our_current_infrastructure.html">Our current infrastructure</a> (Created on 2021-10-26 at 18:18:35)</li>
<li><a href="Notes/20211025183249-an_investigation_into_containerization.html">An investigation into containerization</a> (Created on 2021-10-26 at 08:25:09)</li>
<li><a href="Notes/20211018105127-homepage.html">Notes</a> (Created on 2021-10-26 at 07:15:35)</li>
<li><a href="Notes/20211024201928-upper_6th_meeting.html">Upper 6th Meeting</a> (Created on 2021-10-24 at 19:33:54)</li>
<li><a href="Notes/20211024202440-can_my_project_be_researched.html">Can my project be researched?</a> (Created on 2021-10-24 at 19:31:01)</li>
<li><b>Notes/daily/</b>
<ul class="org-ul">
<li><a href="Notes/daily/2021-10-29.html">2021-10-29</a> (Created on 2021-10-29 at 08:34:43)</li>
<li><a href="Notes/daily/2021-10-28.html">2021-10-28</a> (Created on 2021-10-29 at 08:03:50)</li>
<li><a href="Notes/daily/2021-10-27.html">2021-10-27</a> (Created on 2021-10-28 at 09:21:06)</li>
<li><a href="Notes/daily/2021-10-26.html">2021-10-26</a> (Created on 2021-10-27 at 13:53:03)</li>
<li><a href="Notes/daily/2021-10-25.html">2021-10-25</a> (Created on 2021-10-25 at 09:11:48)</li>
<li><a href="Notes/daily/2021-10-24.html">2021-10-24</a> (Created on 2021-10-25 at 07:26:46)</li>
<li><a href="Notes/daily/2021-10-23.html">2021-10-23</a> (Created on 2021-10-23 at 22:07:27)</li>
</ul></li>
</ul></li>
<li><b>Documents/</b>
<ul class="org-ul">
<li><a href="Documents/project-progression-record.html">(Soon™) Project Progression Record (PPR)</a> (Created on 2021-10-25 at 09:09:39)</li>
<li><a href="Documents/personal-audit.html">EPQ personal audit</a> (Created on 2021-10-25 at 08:49:14)</li>
<li><a href="Documents/poem-based-on-an-image.html">Just existing</a> (Created on 2021-10-25 at 08:19:21)</li>
<li><a href="Documents/questioning-a-co-owner.html">Doing research on what users would like to see</a> (Created on 2021-10-24 at 19:50:17)</li>
<li><a href="Documents/project-idea-mindmap.html">Mindmap of project ideas</a> (Created on 2021-10-24 at 19:38:54)</li>
<li><a href="Documents/process-manager-project-requirements.html">Project specification</a> (Created on 2021-10-24 at 17:23:18)</li>
<li><a href="Documents/why-this-project.html">Why have I chosen this project?</a> (Created on 2021-10-19 at 21:33:19)</li>
</ul></li>
</ul>
</div>
</div>
</div>
</body>
</html>
